//=============================================================================
//
// スコア処理 [score.h]
// Author : 佐藤 諒佳
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "object.h"
#include "manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCORE_WIDTH		(1015)	// スコアの幅
#define MAX_SCORE		(8)		// スコアの最大桁数

//*****************************************************************************
// 前方定義
//*****************************************************************************
class CNumber;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CScore : public CObject
{
public:
	CScore(int nPiority = CManager::PRIORITY_SCORE);
	~CScore();
	static CScore *Create();
	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetScore(int nScore);
	void AddScore(int nValue);
	static int GetScore(void) { return m_nScore; }

private:
	CNumber			*m_apNumber[MAX_SCORE];
	static int		m_nScore;					// スコアの値
};
#endif